In [1]:
import pandas as pd

In [2]:
data = {"Name": ["Tom", "Alice"], "Age": [25, 30]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   25
1  Alice   30

In [13]:
df_data = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A", "B", "C"], index=["x", "y", "z"])

In [16]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [17]:
df_data

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [18]:
df_data.columns

Index(['A', 'B', 'C'], dtype='object')

In [20]:
df_data.index

Index(['x', 'y', 'z'], dtype='object')

In [21]:
df_data.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [ ]:
df_data.nunique() # get nunique data

A    3
B    3
C    3
dtype: int64

In [ ]:
df_data['A'].unique() #get a specific amount of data

array([1, 4, 7])

In [25]:
df_data.shape

(3, 3)

## Loading Data Frames From File

In [ ]:
Coffee = pd.read_csv('./coffee.csv') #read CSV file

In [ ]:
Coffee.head() #get first 5 rows

        Day Coffee Type  Unit Sold
0  Thursday       Mocha         17
1    Monday       Mocha         27
2  Saturday   Americano         32
3  Saturday       Mocha         11
4    Sunday  Cappuccino         13

## Read parquet File in pandas

In [ ]:
Results = pd.read_parquet('./results.parquet') #read data from parquet file
olympics = pd.read_excel('./olympics-data.xlsx') # read data from xlsx file

In [ ]:
Results.head() # get first 5 record from top

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [ ]:
olympics.head() #get first 5 records from top

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

## Access Data with Pandas In diff Ways

In [ ]:
Coffee # we can also do print(Coffee) or Display(Coffee)

          Day Coffee Type  Unit Sold
0    Thursday       Mocha         17
1      Monday       Mocha         27
2    Saturday   Americano         32
3    Saturday       Mocha         11
4      Sunday  Cappuccino         13
5     Tuesday       Latte         41
6    Saturday   Americano         46
7    Saturday       Mocha         30
8    Thursday   Americano         49
9   Wednesday    Espresso         21
10     Monday       Latte         19
11     Monday       Latte         14
12   Thursday    Espresso         43
13  Wednesday    Espresso         29
14     Sunday    Espresso         33
15     Sunday       Mocha         48
16     Monday       Latte         30
17    Tuesday   Americano         30
18  Wednesday       Mocha         46
19     Monday       Mocha         34

In [41]:
Coffee.head(3)

        Day Coffee Type  Unit Sold
0  Thursday       Mocha         17
1    Monday       Mocha         27
2  Saturday   Americano         32

In [46]:
Coffee.tail(3) # tail to get last 5 rows or last 3 rows by adding 3 in tail function

          Day Coffee Type  Unit Sold
17    Tuesday   Americano         30
18  Wednesday       Mocha         46
19     Monday       Mocha         34

In [ ]:
Coffee.sample(5) #we can get different samples of data every time

         Day Coffee Type  Unit Sold
16    Monday       Latte         30
19    Monday       Mocha         34
17   Tuesday   Americano         30
7   Saturday       Mocha         30
11    Monday       Latte         14

In [ ]:
#loc and iloc

Coffee.loc[0] # get data from a specific row

Day            Thursday
Coffee Type       Mocha
Unit Sold            17
Name: 0, dtype: object

In [50]:
Coffee.loc[5:8, ["Day", "Unit Sold"]]

        Day  Unit Sold
5   Tuesday         41
6  Saturday         46
7  Saturday         30
8  Thursday         49